#_author_:张三香 2016.10.20

Feature:运营添加商品分类
	"""
		1.运营点击【+添加分类】按钮，显示'添加/修改分类'弹框
		2.'添加/修改分类'弹框中显示信息:
			a.上级分类:下拉框显示，下拉框中显示所有的一级分类名称，默认显示无
			b.分类名称:当上级分类选择'无'时，则表示添加一级分类名称；当上级分类不是选择'无'，则代表在一级分类下点击二级分类名称
			c.备注：输入框显示，可填写备注信息
			d.【确定】按钮:选择'上级分类'并填写'分类名称'后点击它弹框关闭，分类添加成功；若不填写'分类名称'点击则'分类名称'下方校验提示'内容不能为空'
		3.商品分类列表
			分类名称:显示一级分类名称，链接形式显示，点击它下方展开二级分类详情
				若无二级分类:显示'暂无二级分类'
				有二级分类:分行展示二级分类信息,格式如下
					（二级分类名称/创建时间/商品数:x/【修改】、【删除】、【配置特殊资质】、【配置标签】）
					点击【修改】显示'添加/修改分类'弹框，可修改二级分类所属的一级分类和二级分类名称
					点击【删除】显示'确认删除该商品分类吗？ 确定/取消'
					点击【配置特殊资质】显示'配置特殊资质文件'弹框，可以【添加资质】，配置后按钮变为【已配置资质】
					点击【配置标签】显示'配置标签'弹框，可以设置标签，弹框中默认显示标签列表中的第一个标签信息，配置后按钮变我【已配置标签】
			创建时间:显示一级分类的创建时间
			商品数:属于该分类的所有商品数
			操作:【修改】【删除】
		4.商品分类列表排序:创建时间的倒序
	"""

Background:
	Given manager登录商品管理系统
	When manager添加账号
		"""
		{
			"type":"运营",
			"account_name":"运营账号1",
			"login_name":"yunying",
			"login_password":"test",
			"remark":"账号备注信息",
			"create_time":"2016-10-10 09:00:00"
		}
		"""

Scenario:1 运营添加商品分类
	Given yunying登录商品管理系统
	Then yunying获得商品分类列表
		"""
		[]
		"""
	When yunying添加商品分类
		"""
		{
			"分类1":[],
			"create_time":"2016-10-17 08:00:00"
		}
		"""
	When yunying添加商品分类
		"""
		{
			"分类2":
				[{
					"name":"饼干",
					"create_time":"2016-10-18 08:00:00"
				},{
					"name":"泡面",
					"create_time":"2016-10-18 08:00:00"
				}],
			"create_time":"2016-10-18 08:00:00"
		}
		"""
	Then yunying获得商品分类'分类1'
		"""
		{
			"分类1":[],
			"actions":["修改","删除"]
		}
		"""
	Then yuyning获得商品分类'分类2'
		"""
		{
			"分类2":
				[{
					"name":"饼干",
					"create_time":"2016-10-17 08:00:00",
					"product_count":0,
					"special_qualification":[],
					"label":[],
					"actions":["修改","删除","配置特殊资质","配置标签"]
				},{
					"name":"泡面",
					"create_time":"2016-10-18 08:00:00",
					"product_count":0,
					"special_qualification":[],
					"label":[],
					"actions":["修改","删除","配置特殊资质","配置标签"]
				}],
			"create_time":"2016-10-18 08:00:00",
			"total_product_count":0,
			"actions":["修改","删除"]
		}
		"""
	Then yunying获得商品分类列表
		"""
		[{
			"categroy_name":"分类2",
			"create_time":"2016-10-18 08:00:00",
			"total_product_count":0,
			"actions":["修改","删除"]
		},{
			"categroy_name":"分类1",
			"create_time":"2016-10-17 08:00:00",
			"total_product_count":0,
			"actions":["修改","删除"]
		}]
		"""